MBronsom/OfflineSWD/STM32-OffineSWD/RL/USB/Drivers/usbh_xmc4500.c
/*------------------------------------------------------------------------------
 *      RL-ARM - USB
 *------------------------------------------------------------------------------
 *      Name:    usbh_xmc4500.c
 *      Purpose: Full/Low-speed Host Infineon XMC4500 Driver module
 *      Rev.:    V4.70
 *------------------------------------------------------------------------------
 *      This code is part of the RealView Run-Time Library.
 *      Copyright (c) 2004-2013 KEIL - An ARM Company. All rights reserved.
 *----------------------------------------------------------------------------*/

#include <RTL.h>
#include <rl_usb.h>
#include "usbh_xmc4500.h"
#include "System_XMC4500.h"
#include <xmc4500.h>
#include <string.h>


/************************** Host Controller Driver Structure ******************/

USBH_HCD usbh0_hcd = {                  /* Host Controller Driver structure   */
  USBH_XMC4500_Get_Capabilities,        /* Get Host Ctrl Driver capabilities  */
  USBH_XMC4500_Delay_ms,                /* Delay in ms                        */
  USBH_XMC4500_Pins_Config,             /* Config/Unconfig pins               */
  USBH_XMC4500_Init,                    /* Init/Uninit Host Controller        */
  USBH_XMC4500_Port_Power,              /* On/Off Port Power                  */
  USBH_XMC4500_Port_Reset,              /* Reset port                         */
  USBH_XMC4500_Get_Connect,             /* Get port conn/disconn status       */
  USBH_XMC4500_Get_Speed,               /* Get port enumerated speed          */
  USBH_XMC4500_EP_Add,                  /* Add Endpoint                       */
  USBH_XMC4500_EP_Config,               /* (Re)Configure Endpoint             */
  USBH_XMC4500_EP_Remove,               /* Remove Endpoint                    */
  USBH_XMC4500_URB_Submit,              /* Submit USB Block Request           */
  USBH_XMC4500_URB_Cancel               /* Cancel USB Block Request           */
};


/************************** Driver Settings ***********************************/

//-------- <<< Use Configuration Wizard in Context Menu >>> --------------------

//  <o0> Size of memory used by the USB Host Controller <1-1048576>
//  <i> This is a size of memory (in bytes) that the USB Host Controller 
//  <i> will use for USB communication data.
#define USBH_XMC4500_SZ_MPOOL     0x00000234


/************************** Variable and Memory Definitons ********************/

#define MAX_TIMEOUT_COUNT         100
#define DEBOUNCE_500ms            500

#define USB0_MAX_CH               14

static U32 *USB0_DFIFO[USB0_MAX_CH]={ (U32 *)(USB0_BASE + 0x1000), (U32 *)(USB0_BASE + 0x2000), 
                                      (U32 *)(USB0_BASE + 0x3000), (U32 *)(USB0_BASE + 0x4000), 
                                      (U32 *)(USB0_BASE + 0x5000), (U32 *)(USB0_BASE + 0x6000), 
                                      (U32 *)(USB0_BASE + 0x7000), (U32 *)(USB0_BASE + 0x8000), 
                                      (U32 *)(USB0_BASE + 0x9000), (U32 *)(USB0_BASE + 0xA000), 
                                      (U32 *)(USB0_BASE + 0xB000), (U32 *)(USB0_BASE + 0xC000), 
                                      (U32 *)(USB0_BASE + 0xD000), (U32 *)(USB0_BASE + 0xE000) }; 

/* Reserve memory for memory pool */ 
       U32       USBH_MPOOL[(USBH_XMC4500_SZ_MPOOL+3)>>2];

static BOOL      HW_Accessing                      = { __FALSE };
static USBH_URB *CHURB             [USB0_MAX_CH]   = { 0 };
static U8        cntInterval       [USB0_MAX_CH]   = { 0 };
static U8        cntIntervalMax    [USB0_MAX_CH]   = { 0 };
static U16       cntDebounce                       = { 0 };
static U32       calDelay                          =   0  ;
static U32       Port_Discon_Evt                   = { 0 };
static U32       Port_Speed                        = { 0 };
static U32       Port_Con                          = { 0 };


/************************** Local Module Functions ****************************/


/***----------------------- Channel Functions ------------------------------***/

/*------------------------- USBH_XMC4500_CH_GetIndexFromCH ---------------------
 *
 *  Get the Index of Channel from it's Address
 *
 *  Parameter:  ptrCH:      Pointer to the Channel
 *  Return:                 Index of the Channel
 *----------------------------------------------------------------------------*/

static U32 USBH_XMC4500_CH_GetIndexFromCH (USBH_XMC4500_CH *ptrCH) {
  return (ptrCH - (USBH_XMC4500_CH *)(USB0_CH0));
}


/*------------------------- USBH_XMC4500_CH_GetCHFromIndex ---------------------
 *
 *  Get the Channel Address from it's Index
 *
 *  Parameter:  idx:        Index of the Channel
 *  Return:                 Address of the Channel
 *----------------------------------------------------------------------------*/

static USBH_XMC4500_CH *USBH_XMC4500_CH_GetCHFromIndex (U32 idx) {
  return ((USBH_XMC4500_CH *)(USB0_CH0) + idx);
}


/*------------------------- USBH_XMC4500_CH_FindFree ---------------------------
 *
 *  Find a free Channel
 *
 *  Parameter:
 *  Return:                 Pointer to the first free Channel
 *                          (0 = no free Channel is available)
 *----------------------------------------------------------------------------*/

static void *USBH_XMC4500_CH_FindFree (void) {
  USBH_XMC4500_CH *ptr_CH;
  U32              i;

  ptr_CH = (USBH_XMC4500_CH *)(USB0_CH0);

  for (i = 0; i < USB0_MAX_CH; i++) {
    if (!ptr_CH->HCCHAR) {
      return (ptr_CH);
    }
    ptr_CH++;
  }

  return (0);
}


/*------------------------- USBH_XMC4500_CH_Disable ----------------------------
 *
 *  Disable the Channel
 *
 *  Parameter:  ptrCH:      Pointer to the Channel
 *  Return:                 __TRUE = Ok, __FALSE = error
 *----------------------------------------------------------------------------*/

static BOOL USBH_XMC4500_CH_Disable (USBH_XMC4500_CH *ptrCH) {
  S32 tout;

  if (!ptrCH) 
    return (__FALSE);

  ptrCH->HCINTMSK  =  0;
  USBH_XMC4500_Delay_ms (2);
  if (ptrCH->HCCHAR & USB_CH_HCCHAR_ChEna_Msk) {
    ptrCH->HCINT     =  ~USB_CH_HCINT_ChHltd_Msk;
    ptrCH->HCCHAR    =  (ptrCH->HCCHAR  |  USB_CH_HCCHAR_ChEna_Msk);
    USBH_XMC4500_Delay_ms (2);
    ptrCH->HCCHAR    =  (ptrCH->HCCHAR  & ~USB_CH_HCCHAR_ChEna_Msk) | USB_CH_HCCHAR_ChDis_Msk;
    for (tout=1000; tout>=0; tout--) {            /* Wait                     */            
      if (ptrCH->HCINT & USB_CH_HCINT_ChHltd_Msk) /* If transaction done      */
        break;
      if ((ptrCH->HCCHAR & (USB_CH_HCCHAR_ChEna_Msk | USB_CH_HCCHAR_ChDis_Msk)) == (USB_CH_HCCHAR_ChEna_Msk | USB_CH_HCCHAR_ChDis_Msk)) 
        break;
      if (tout ==  0) return (__FALSE);
      if (tout <= 10) USBH_XMC4500_Delay_ms (10); /* for max 100 ms           */
    }
  }

  return (__TRUE);
}


/*------------------------- USBH_XMC4500_CH_TransferEnqueue --------------------
 *
 *  Enqueue the Transfer
 *
 *  Parameter:  ptrCH:      Pointer to the channel on which transfer will take place
 *              tgl_typ:    Toggle (bit 5..4: bit 5 - force toggle, bit 4 - value) and 
 *                          Packet type (bit 3..0: USBH_PACKET_IN, USBH_PACKET_OUT or USBH_PACKET_SETUP)
 *              buf:        Start of the receive or transmit data buffer
 *              len:        Length of the data to be received or sent
 *  Return:                 __TRUE = Ok, __FALSE = error
 *----------------------------------------------------------------------------*/

static BOOL USBH_XMC4500_CH_TransferEnqueue (USBH_XMC4500_CH *ptrCH, U32 tgl_typ, U8 *buf, U32 len) {
  U32  hcchar;
  U32  hctsiz;
  U32  hcintmsk;
  U32  mps;
  U32  ch_idx;
  U32  num;
  U32 *ptr_src, *ptr_dst;
  BOOL load_data;

  if (!ptrCH)
    return (__FALSE);

