MBronsom/OfflineSWD/STM32-OffineSWD/RL/USB/Drivers/usbh_xmc4500.c
  if (!Port_Con)
    return (__FALSE);

  hcchar   = ptrCH->HCCHAR;                       /* Read channel characterist*/
  hctsiz   = ptrCH->HCTSIZ;                       /* Read channel size info   */
  hcintmsk = 0;

  /* Prepare transfer                                                         */
                                                  /* Prepare HCCHAR register  */
  hcchar        &= USB_CH_HCCHAR_OddFrm_Msk  |    /* Keep ODDFRM              */
                   USB_CH_HCCHAR_DevAddr_Msk |    /* Keep DEVADDR             */
                   USB_CH_HCCHAR_MC_EC_Msk   |    /* Keep MC_EC               */
                   USB_CH_HCCHAR_EPType_Msk  |    /* Keep EPTYP               */
                   USB_CH_HCCHAR_LSpdDev_Msk |    /* Keep LSPDDEV             */
                   USB_CH_HCCHAR_EPNum_Msk   |    /* Keep EPNUM               */
                   USB_CH_HCCHAR_MPS_Msk ;        /* Keep MPS                 */
  switch (tgl_typ & 0x0F) {
    case USBH_PACKET_IN:
      hcchar   |=  USB_CH_HCCHAR_EPDir_Msk;
      hcintmsk  =  USB_CH_HCINTMSK_DataTglErrMsk_Msk | 
                   USB_CH_HCINTMSK_BblErrMsk_Msk     | 
                   USB_CH_HCINTMSK_XactErrMsk_Msk    | 
                   USB_CH_HCINTMSK_AckMsk_Msk        | 
                   USB_CH_HCINTMSK_NakMsk_Msk        | 
                   USB_CH_HCINTMSK_StallMsk_Msk      | 
                   USB_CH_HCINTMSK_XferComplMsk_Msk  ;
      break;
    case USBH_PACKET_OUT:
      hcchar   &= ~USB_CH_HCCHAR_EPDir_Msk;
      hcintmsk  =  USB_CH_HCINTMSK_XactErrMsk_Msk    | 
                   USB_CH_HCINTMSK_NyetMsk_Msk       | 
                   USB_CH_HCINTMSK_NakMsk_Msk        | 
                   USB_CH_HCINTMSK_StallMsk_Msk      | 
                   USB_CH_HCINTMSK_XferComplMsk_Msk  ;
      break;
    case USBH_PACKET_SETUP:
      hcchar   &= ~USB_CH_HCCHAR_EPDir_Msk;
      hcintmsk  =  USB_CH_HCINTMSK_XactErrMsk_Msk    | 
                   USB_CH_HCINTMSK_NakMsk_Msk        | 
                   USB_CH_HCINTMSK_StallMsk_Msk      | 
                   USB_CH_HCINTMSK_XferComplMsk_Msk  ;
      break;
  }
  hcchar &= ~USB_CH_HCCHAR_ChDis_Msk;
  hcchar |=  USB_CH_HCCHAR_ChEna_Msk;

                                                  /* Prepare HCTSIZ register  */
  hctsiz &= USB_CH_HCTSIZ_BUFFERMODE_Pid_Msk;     /* Keep Data PID            */
  if ((tgl_typ & 0x0F) == USBH_PACKET_SETUP) {    /* If setup pckt DPID=MDATA */
    hctsiz &= ~USB_CH_HCTSIZ_BUFFERMODE_Pid_Msk;
    hctsiz |= (3 << USB_CH_HCTSIZ_BUFFERMODE_Pid_Pos);      /* MDATA/SETUP PID*/
  } else if ((tgl_typ >> 5) & 1) {                /* If toggle force bit activ*/
    hctsiz &= ~USB_CH_HCTSIZ_BUFFERMODE_Pid_Msk;
    if ((tgl_typ >> 4) & 1) {                     /* Toggle bit value         */
      hctsiz |=  (2 << USB_CH_HCTSIZ_BUFFERMODE_Pid_Pos);   /* DATA1 PID      */
    } else {
      hctsiz |=  (0 << USB_CH_HCTSIZ_BUFFERMODE_Pid_Pos);   /* DATA0 PID      */
    }
  }

  mps = hcchar & 0x7FF;                           /* Maximum packet size      */
  if (len) {                                      /* Normal packet            */
    hctsiz |= ((len+mps-1) / mps) << 19;          /* Prepare PKTCNT field     */
    hctsiz |= ( len             ) <<  0;          /* Prepare XFERSIZE field   */
  } else {                                        /* Zero length packet       */
    hctsiz |= ( 1               ) << 19;          /* Prepare PKTCNT field     */
    hctsiz |= ( 0               ) <<  0;          /* Prepare XFERSIZE field   */
  }

  ch_idx  = USBH_XMC4500_CH_GetIndexFromCH (ptrCH);

  /* load_data == __TRUE if there is data to be loaded to FIFO 
    (If packet is OUT or SETUP and len > 0)                                   */
  load_data = (((tgl_typ & 0x0F) == USBH_PACKET_OUT)    || 
               ((tgl_typ & 0x0F) == USBH_PACKET_SETUP)) && 
                 len; 
  num = (len + 3) / 4;
  ptr_dst = USB0_DFIFO[ch_idx];
  ptr_src = (U32 *) buf;

  ptrCH->HCINTMSK = hcintmsk;                     /* Enable channel interrupts*/
  ptrCH->HCTSIZ   = hctsiz;                       /* Write ch transfer size   */
//ptrCH->DMAADDR  = (U32)buf;                     /* In DMA Buffer mode addr  */
  ptrCH->HCCHAR   = hcchar;                       /* Write ch characteristics */

  if (load_data) {
    while (num--) {
      while (!((USB0->GNPTXSTS & 0x00FF0000) && (USB0->GNPTXSTS & 0x0000FFFF)));
      *ptr_dst = *ptr_src++;
    }
  }

  return (__TRUE);
}


/************************** Module Functions **********************************/

/*------------------------- USBH_XMC4500_Get_Capabilities ----------------------
 *
 *  Get capabilities of Host Controller Driver
 *
 *  Parameter:  cap:        Pointer to USBH_HCI_CAP structure where 
 *                          capabilities are loaded
 *  Return:
 *----------------------------------------------------------------------------*/

void USBH_XMC4500_Get_Capabilities (USBH_HCI_CAP *cap) {
  cap->MultiPckt = __FALSE;
  cap->MaxDataSz = 512;
  cap->CtrlNAKs  = 100000;
  cap->BulkNAKs  = 1000000;
}


/*------------------------- USBH_XMC4500_Delay_ms ------------------------------
 *
 *  Delay execution (in milliseconds)
 *  Calibration is done if global variable calDelay is 0
 *
 *  Parameter:  ms:         Number of milliseconds to delay execution for
 *  Return:
 *----------------------------------------------------------------------------*/

void USBH_XMC4500_Delay_ms (U32 ms) {
  U32 cnt = 0, vals = 0, vale = 0;

start:
  if (!calDelay) {                      /* If not calibrated                  */
    cnt = 1000;
    if (!(SysTick->CTRL & SysTick_CTRL_ENABLE_Msk)) {
                                        /* If SysTick timer not running       */
      vals = 0xFFFFFF;
      SysTick->LOAD  = 0xFFFFFF;
      SysTick->VAL   = 0xFFFFFF;
      SysTick->CTRL  = SysTick_CTRL_CLKSOURCE_Msk | 
                       SysTick_CTRL_ENABLE_Msk;
    } else {
      vals = SysTick->VAL;              /* Timer start value                  */
    }
  } else {
    cnt = ms * calDelay;
  }

  while (cnt--);

  if (!calDelay) {                      /* If not calibrated                  */
    vale = SysTick->VAL;                /* Timer end value                    */
    if (vale >= vals)                   /* If timer reloaded                  */
      vals += SysTick->LOAD;
    calDelay = SystemCoreClock / (vals - vale);   /* Calibrated value         */
    if (vals == 0xFFFFFF)               /* Stop timer if we started it        */
      SysTick->CTRL  = 0;
    goto start;
  }
}


/*------------------------- USBH_XMC4500_Pins_Config ---------------------------
 *
 *  Configure or unconfigure pins used by the USB Host
 *
 *  Parameter:  on:         __TRUE = configure, __FALSE = unconfigure
 *  Return:                 __TRUE = Ok, __FALSE = error
 *----------------------------------------------------------------------------*/

BOOL USBH_XMC4500_Pins_Config (BOOL on) {

  if (on) {
    /* Set P3.2 as alternate function 1 (USB.DRIVEVBUS), Push-pull            */
    PORT3->IOCR0  &= ~PORT3_IOCR0_PC2_Msk;
    PORT3->IOCR0  |= (0x11 << PORT3_IOCR0_PC2_Pos);
  } else {
    PORT3->IOCR0  &= ~PORT3_IOCR0_PC2_Msk;
  }

  return (__TRUE);
}


/*------------------------- USBH_XMC4500_Init ----------------------------------
 *
 *  Initialize or uninitialize the USB Host Controller
 *
 *  Parameter:  on:         __TRUE = initialize, __FALSE = uninitialize
 *  Return:                 __TRUE = Ok, __FALSE = error
 *----------------------------------------------------------------------------*/

