MBronsom/OfflineSWD/STM32-OffineSWD/RL/USB/Drivers/usbh_xmc4500.c
BOOL USBH_XMC4500_Init (BOOL on) {
  S32 tout;

  if (on) {
    /* Initialize memory pool for data                                        */
    if (!usbh_mem_init(0, (U32 *)&USBH_MPOOL, USBH_XMC4500_SZ_MPOOL))
      return (__FALSE);

    SCU_CLK->CLKSET |= 1;                           /* USB Clock Enable       */
    for (tout=1000; tout>=0; tout--) {              /* Wait                   */
      if (SCU_CLK->CLKSTAT & 1) break;
      if (tout ==  0) return (__FALSE);
      if (tout <= 10) USBH_XMC4500_Delay_ms (10);   /* for max 100 ms         */
    }

    SCU_RESET->PRCLR2 |=  (1 <<  7);                /* USB Peri Reset Clear   */
    SCU_POWER->PWRSET |=  (1 << 16) | (1 << 17);    /* USB PHY En + OTG En    */

    USB0->GRSTCTL |= USB_GRSTCTL_CSftRst_Msk;       /* USB Core Soft Reset    */
    for (tout=1000; tout>=0; tout--) {              /* Wait                   */
      if (!(USB0->GRSTCTL & USB_GRSTCTL_CSftRst_Msk)) break;
      if (tout ==   0) return (__FALSE);
      if (tout <= 100) USBH_XMC4500_Delay_ms (10);  /* for max 1000 ms        */
    }

    USBH_XMC4500_Delay_ms (100);                    /* Wait ~100 ms           */

    /* Core initialization                                                    */
//  USB0->GAHBCFG  |=  USB_GAHBCFG_DMAEn_Msk;       /* Enable buffered DMA    */
    USB0->GAHBCFG  |=  USB_GAHBCFG_GlblIntrMsk_Msk; /* Enable interrupts      */
    USB0->GUSBCFG  |= (USB_GUSBCFG_ForceHstMode_Msk     |   /* Force host mode*/
                      (15 << USB_GUSBCFG_USBTrdTim_Pos) |   /* TrdTim = 15    */
                       USB_GUSBCFG_PHYSel_Msk);             /* Full-speed trns*/
    USBH_XMC4500_Delay_ms (100);                    /* Wait ~100 ms           */

    USB0->GRXFSIZ   =  282;                         /* RxFIFO depth is 1128 by*/
    USB0->GNPTXFSIZ_HOSTMODE = (16 << 16) | (282);  /* Non-periodic TxFIFO    */
    USB0->HPTXFSIZ  = (16 << 16) | (282+16);        /* Periodic TxFIFO mem    */

    USB0->GINTMSK_HOSTMODE  |=  USB_GINTMSK_HOSTMODE_DisconnIntMsk_Msk | /* Enable ints*/
                       USB_GINTMSK_HOSTMODE_HChIntMsk_Msk     | 
                       USB_GINTMSK_HOSTMODE_PrtIntMsk_Msk     | 
                       USB_GINTMSK_HOSTMODE_RxFLvlMsk_Msk     | 
                       USB_GINTMSK_HOSTMODE_SofMsk_Msk        ;
    if (!(USB0->HCFG & 3)) {
      USB0->HCFG   |= (1 << USB_CH_HCFG_FSLSPclkSel_Pos) |  /* PHY clk 48MHz  */
                      (1 << USB_CH_HCFG_FSLSSupp_Pos)    ;  /* FS/LS only     */
    }
    USB0->HAINTMSK  =  0x1FFF;                        /* Enable all ch ints   */

    NVIC_SetPriority (USB0_0_IRQn, 0);  /* Set USB0 interrupt highest priority*/
    NVIC_EnableIRQ   (USB0_0_IRQn);     /* Enable USB0 interrupt              */
  } else {
    NVIC_DisableIRQ  (USB0_0_IRQn);     /* Disable USB0 interrupt             */

    USB0->HAINTMSK  =  0;
    USB0->HPRT      =  0;
    USB0->HCFG      =  0x200;
    USB0->GINTMSK_HOSTMODE   =  0;
    USB0->GUSBCFG   =  0x1440;
    calDelay = 0;                                 /* Force delay recalibrate  */
  }

  return (__TRUE);
}


/*------------------------- USBH_XMC4500_Port_Power ----------------------------
 *
 *  Turn USB Host port power on or off
 *
 *  Parameter:  on:         __TRUE = power on, __FALSE = power off
 *  Return:                 __TRUE = Ok, __FALSE = error
 *----------------------------------------------------------------------------*/

BOOL USBH_XMC4500_Port_Power (BOOL on) {

  if (on) {
    USB0->HPRT     |=  USB_HPRT_PrtPwr_Msk;       /* Port power on            */
  } else { 
    USB0->HPRT     &= ~USB_HPRT_PrtPwr_Msk;       /* Port power off           */
  }

  return (__TRUE);
}


/*------------------------- USBH_XMC4500_Port_Reset ----------------------------
 *
 *  Reset Port
 *
 *  Parameter:  port:       Root Hub port to be reset (only 0 is available)
 *  Return:                 __TRUE = Ok, __FALSE = error
 *----------------------------------------------------------------------------*/

BOOL USBH_XMC4500_Port_Reset (U8 port) {
  S32 tout;

  if (!Port_Con)
    return (__FALSE);

  USB0->HPRT |=  USB_HPRT_PrtRst_Msk;                 /* Port reset           */
  USBH_XMC4500_Delay_ms (17);                         /* Wait ~17 ms          */
  USB0->HPRT &= ~USB_HPRT_PrtRst_Msk;                 /* Clear port reset     */

  for (tout=1000; tout>=0; tout--) {                  /* Wait                 */            
    if ((USB0->HPRT & USB_HPRT_PrtEna_Msk)) {         /* If port enabled      */
      USB0->HFIR  = 48000;
      break;
    }
    if (tout ==  0) return (__FALSE);
    if (tout <= 10) USBH_XMC4500_Delay_ms (10);       /* for max 100 ms       */
  }

  USBH_XMC4500_Delay_ms (20);                         /* Wait ~20 ms          */

  return (__TRUE);
}


/*------------------------- USBH_XMC4500_Get_Connect ---------------------------
 *
 *  Returns connect/disconnect port events (also does debouncing)
 *
 *  Parameter:              None
 *  Return:                 Connection/Disconnection events
 *----------------------------------------------------------------------------*/

U32 USBH_XMC4500_Get_Connect (void) {
  U32 ret, stat;

  stat = (USB0->HPRT & USB_HPRT_PrtConnSts_Msk);
  ret  = Port_Discon_Evt;
  ret |= ((stat ^ Port_Con) && (Port_Con));

  if (ret){                             /* If port disconnect occured         */
    Port_Discon_Evt &= ~ret;
    return (ret << 16);
  }

  if (cntDebounce) {
    cntDebounce--;
    if (!cntDebounce) {                 /* If debounce time expired           */
      ret = ((stat ^ Port_Con) && (!Port_Con));
                                        /* If debounce expired on conn 0 -> 1 */
      Port_Con |= ret;
    } else {
      USBH_XMC4500_Delay_ms (1);
    }
  } else if ((stat ^ Port_Con) && (!Port_Con)) {
                                        /* Restart debouncing if connect      */
    cntDebounce = DEBOUNCE_500ms;
  }

  return (ret);
}


/*------------------------- USBH_XMC4500_Get_Speed -----------------------------
 *
 *  Returns port speeds
 *
 *  Parameter:              None
 *  Return:                 Port speeds
 *----------------------------------------------------------------------------*/

