MBronsom/OfflineSWD/STM32-OffineSWD/RL/USB/Drivers/usbh_xmc4500.c
U32 USBH_XMC4500_Get_Speed (void) {
  return (Port_Speed); 
}


/*------------------------- USBH_XMC4500_EP_Config -----------------------------
 *
 *  (Re)Configure some parameters of the Endpoint
 *
 *  Parameter:  hndl:       Handle to the Configured Endpoint
 *              dev_adr:    Device Address
 *              ep_spd:     Endpoint Speed
 *              ptrEPD:     Pointer to the USB Standard Endpoint Descriptor
 *  Return:                 __TRUE = Ok, __FALSE = error
 *----------------------------------------------------------------------------*/

BOOL USBH_XMC4500_EP_Config (U32 hndl, U8 dev_adr, U8 ep_spd, USB_ENDPOINT_DESCRIPTOR *ptrEPD) {
  USBH_XMC4500_CH *ptr_CH;

  if (!hndl) 
    return (__FALSE);

  ptr_CH = (USBH_XMC4500_CH *)(hndl);
  if (!USBH_XMC4500_CH_Disable (ptr_CH)) 
    return (__FALSE);

  /* Fill in all fields of Endpoint Descriptor                                */
  ptr_CH->HCCHAR = (((ptrEPD->wMaxPacketSize       ) & 0x07FF)       <<  0) | 
                   (((ptrEPD->bEndpointAddress     ) & 0x000F)       << 11) | 
                   (((ptrEPD->bEndpointAddress >> 7) & 0x0001)       << 15) | 
                   ((ptrEPD->bmAttributes & USB_ENDPOINT_TYPE_MASK)  << 18) | 
                   ((dev_adr                         & 0x007F)       << 22) ;

  switch (ptrEPD->bmAttributes & USB_ENDPOINT_TYPE_MASK) {
    case USB_ENDPOINT_TYPE_CONTROL:
    case USB_ENDPOINT_TYPE_BULK:
      break;
    case USB_ENDPOINT_TYPE_ISOCHRONOUS:
    case USB_ENDPOINT_TYPE_INTERRUPT:
      cntIntervalMax[USBH_XMC4500_CH_GetIndexFromCH (ptr_CH)] = ptrEPD->bInterval;
      ptr_CH->HCCHAR |= 1 << USB_CH_HCCHAR_MC_EC_Pos;
      break;
  }

  return (__TRUE);
}


/*------------------------- USBH_XMC4500_EP_Add --------------------------------
 *
 *  Add the Endpoint and return handle (address of the Endpoint)
 *
 *  Parameter:  dev_adr:    Device Address
 *              ep_spd:     Endpoint Speed
 *              ptrEPD:     Pointer to the USB Standard Endpoint Descriptor
 *  Return:                 Handle to the Configured Endpoint (0 = FAIL)
 *----------------------------------------------------------------------------*/

U32 USBH_XMC4500_EP_Add (U8 dev_adr, U8 ep_spd, USB_ENDPOINT_DESCRIPTOR *ptrEPD) {
  USBH_XMC4500_CH *ptr_CH;

  ptr_CH = (USBH_XMC4500_CH *)(USBH_XMC4500_CH_FindFree ());  /* Find free Ch */
  if (!ptr_CH) {                                              /* If no free   */
    return (0);
  }

  if (USBH_XMC4500_EP_Config ((U32)ptr_CH, dev_adr, ep_spd, ptrEPD)) {
    return ((U32)ptr_CH);
  }

  return (0);
}


/*------------------------- USBH_XMC4500_EP_Remove -----------------------------
 *
 *  Remove the Endpoint
 *
 *  Parameter:  hndl:       Handle to the Configured Endpoint
 *  Return:                 __TRUE = Ok, __FALSE = error
 *----------------------------------------------------------------------------*/

BOOL USBH_XMC4500_EP_Remove (U32 hndl) {
  USBH_XMC4500_CH *ptr_CH;
  USBH_URB        *ptr_URB;
  U32              ch_idx;

  if (!hndl) 
    return (__FALSE);

  ptr_CH = (USBH_XMC4500_CH *)(hndl);
  ch_idx              = USBH_XMC4500_CH_GetIndexFromCH (ptr_CH);
  ptr_URB = CHURB[ch_idx];              /* Pointer to channels URB            */
  if (ptr_URB) {                        /* If URB exists cancel it            */
    if (!USBH_XMC4500_URB_Cancel (hndl, ptr_URB)) 
      return (__FALSE);
  }

  ptr_CH->HCCHAR      = 0;
  ptr_CH->HCINT       = 0;
  ptr_CH->HCINTMSK    = 0;
  ptr_CH->HCTSIZ      = 0;

  cntInterval[ch_idx] = 0;

  return (__TRUE);
}


/*------------------------- USBH_XMC4500_URB_Submit ----------------------------
 *
 *  Submit the URB (USB Request Block) to be processed
 *
 *  Parameter:  hndl:       Endpoint handle (Endpoint address in memory)
 *              ptrURB:     Pointer to the URB
 *  Return:                 __TRUE = Ok, __FALSE = error
 *----------------------------------------------------------------------------*/

BOOL USBH_XMC4500_URB_Submit (U32 hndl, USBH_URB *ptrURB) {
  USBH_XMC4500_CH *ptr_CH;
  U32              ch_idx;
  U8               resp_type;

  if (!hndl) 
    return (__FALSE);

  if (!ptrURB) 
    return (__FALSE);

  if (!Port_Con)
    return (__FALSE);

  if ((ptrURB->Submitted == 1) || (ptrURB->InProgress == 1)) 
    return (__FALSE);

  resp_type               = ptrURB->ResponsePacketType;

  ptrURB->DataTransferred = 0;
  ptrURB->Status          = 0;

  ptrURB->TimeoutCount    = MAX_TIMEOUT_COUNT;
  ptr_CH                  = (USBH_XMC4500_CH *)(hndl);
  ch_idx                  = USBH_XMC4500_CH_GetIndexFromCH (ptr_CH);
  CHURB[ch_idx]           = ptrURB;

  if (ptr_CH->EPTYP == USB_ENDPOINT_TYPE_INTERRUPT) {
                                        /* If interrupt endpoint transfer     */
    if (resp_type == USBH_PACKET_NAK) {
      cntInterval[ch_idx] = cntIntervalMax[ch_idx];
    } else {
      cntInterval[ch_idx] = 1;          /* Enable transmission on next SOF    */
    }
    ptrURB->Submitted     = 1;
  } else if ((ptr_CH->EPTYP == USB_ENDPOINT_TYPE_CONTROL) || (ptr_CH->EPTYP == USB_ENDPOINT_TYPE_BULK)) {
    if ((Port_Speed & 3) != USBH_LS) {
      HW_Accessing        = __TRUE;
      ptrURB->Submitted   = 1;
      ptrURB->InProgress  = 1;
      USBH_XMC4500_CH_TransferEnqueue (ptr_CH, (U8)ptrURB->Parameters, (U8 *)ptrURB->ptrDataBuffer, (U32)ptrURB->DataLength);
      HW_Accessing        = __FALSE;
    } else {
      ptrURB->Submitted   = 1;
    }
  }

  return (__TRUE);
}


/*------------------------- USBH_XMC4500_URB_Cancel ----------------------------
 *
 *  Cancel the URB (USB Request Block)
 *
 *  Parameter:  hndl:       Endpoint handle (Endpoint address in memory)
 *              ptrURB:     Pointer to the URB
 *  Return:                 __TRUE = Ok, __FALSE = error
 *----------------------------------------------------------------------------*/

BOOL USBH_XMC4500_URB_Cancel (U32 hndl, USBH_URB *ptrURB) {
  USBH_XMC4500_CH *ptr_CH;
  U32              ch_idx;

  if (!hndl) 
    return (__FALSE);

