MBronsom/OfflineSWD/STM32-OffineSWD/RL/USB/Drivers/usbh_xmc4500.c
  if (!ptrURB) 
    return (__FALSE);

  if (!ptrURB->Submitted) 
    return (__TRUE);

  ptrURB->Submitted = 0;

  ptr_CH = (USBH_XMC4500_CH *)(hndl);
  if (ptrURB->InProgress == 1) {
    if (!USBH_XMC4500_CH_Disable (ptr_CH))  /* Stop Endpoint processing       */
      return (__FALSE);
    ptrURB->InProgress  = 0;
  }

  ch_idx = USBH_XMC4500_CH_GetIndexFromCH (ptr_CH);

  if (!cntInterval[ch_idx]) {           /* If interrupt endpoint transfer     */
    cntInterval[ch_idx] = 0;            /* Disable transmission on next SOF   */
  }
  CHURB[ch_idx] = 0;
  ptrURB->Cancelled = 1;

  return (__TRUE);
}


/*------------------------- USB0_0_IRQHandler ----------------------------------
 *
 *  XMC4500 USB Interrupt Handler Routine
 *
 *  Parameter:
 *  Return:
 *----------------------------------------------------------------------------*/

void USB0_0_IRQHandler (void) {
  USBH_XMC4500_CH  *ptr_CH;
  USBH_URB         *ptr_URB;
  U8               *ptrData8;
  U32              *ptrData32;
  U32              *DFIFO;
  U32               gintsts, hprt, haint, hcint, pktcnt, mps;
  U32               grxsts, bcnt, ch, dat, len, len_rest;
  U32               act;

  /* Read global interrupt register                                           */
  gintsts =  USB0->GINTSTS_HOSTMODE & USB0->GINTMSK_HOSTMODE;
  hprt    =  USB0->HPRT;
  haint   =  USB0->HAINT;

  /* Analyze interrupt                                                        */
  if (gintsts & USB_GINTSTS_HOSTMODE_Sof_Msk) {   /* If start of frame int    */
    for (ch = 0; ch < USB0_MAX_CH; ch++) {
      if (CHURB[ch]) {
        if (CHURB[ch]->TimeoutCount) {            /* If timeout not 0         */
          if (!(--CHURB[ch]->TimeoutCount)) {
            CHURB[ch]->Timeout = 1;               /* If timeout expired       */
          }
        }
      }
    }
  }

  if (gintsts&USB_GINTSTS_HOSTMODE_PrtInt_Msk) {  /* If host port interrupt   */
    if (hprt & USB_HPRT_PrtConnDet_Msk) {         /* Port connect detected    */
      if (!Port_Con) {
        cntDebounce = DEBOUNCE_500ms;
      }
    }
    if (hprt & USB_HPRT_PrtEnChng_Msk) {          /* If port enable changed   */
      if (hprt & USB_HPRT_PrtEna_Msk) {           /* If device connected      */
        Port_Speed &= ~3;
        switch ((hprt >> 17) & 3) {
          case 0:
            break;
          case 1:
            Port_Speed |= USBH_FS;
            break;
          case 2:
            break;
          case 3:
            break;
        }
      } 
      if (!(hprt & USB_HPRT_PrtConnSts_Msk) &&    /* If device disconnected   */
            Port_Con) { 
        Port_Discon_Evt = 1;
        Port_Con        = 0;
      }
    }
    hprt &= ~USB_HPRT_PrtEna_Msk;                 /* Leave PENA bit           */
    USB0->HPRT = hprt;                            /* Clear host port interrupt*/
  }
  if ((gintsts & USB_GINTSTS_HOSTMODE_DisconnInt_Msk) &&    /* If disconnected*/
       Port_Con) { 
    Port_Discon_Evt = 1;
    Port_Con        = 0;
  }

  if (Port_Discon_Evt) {                          /* If disconnect detected   */
    ptr_CH = (USBH_XMC4500_CH *)(USB0_CH0);
    for (ch = 0; ch < USB0_MAX_CH; ch++) {
      if (CHURB[ch]) 
        USBH_XMC4500_URB_Cancel ((U32)USBH_XMC4500_CH_GetCHFromIndex (ch), CHURB[ch]);
      ptr_CH++;
    }
  }
                                                  /* Handle reception int     */
  if (gintsts & USB_GINTSTS_HOSTMODE_RxFLvl_Msk) {/* If RXFIFO non-empty int  */
    USB0->GINTMSK_HOSTMODE &= ~USB_GINTMSK_HOSTMODE_RxFLvlMsk_Msk;
    grxsts = USB0->GRXSTSR_HOSTMODE;
    if (((grxsts >> 17) & 0x0F) == 0x02){         /* If PKTSTS = 0x02         */
      grxsts     = (USB0->GRXSTSP_HOSTMODE);
      ch         = (grxsts >> 0) & 0x00F;
      bcnt       = (grxsts >> 4) & 0x7FF;
      ptr_CH     = USBH_XMC4500_CH_GetCHFromIndex (ch);
      DFIFO      = USB0_DFIFO[ch];
      ptr_URB    = CHURB[ch];                     /* Pointer to channels URB  */
      ptrData32  = (U32 *)(ptr_URB->ptrDataBuffer + ptr_URB->DataTransferred);
      len        = bcnt / 4;                      /* Received number of bytes */
      len_rest   = bcnt & 3;                      /* Number of bytes left     */
      while (len--) {
        *ptrData32++    = *DFIFO;
        ptr_URB->DataTransferred += 4;
      }
      if (len_rest) {
        dat      = *DFIFO;
        ptrData8 = (U8 *)ptrData32;
        while (len_rest--) {
          *ptrData8++   = dat;
          dat         >>= 8;
          ptr_URB->DataTransferred ++;
        }
      }
    } else {                                      /* If PKTSTS != 0x02        */
      grxsts     = USB0->GRXSTSP_HOSTMODE;
    }
    USB0->GINTMSK_HOSTMODE |= USB_GINTMSK_HOSTMODE_RxFLvlMsk_Msk;
  }
                                                  /* Handle transmission int  */
  if (gintsts & USB_GINTSTS_HOSTMODE_HChInt_Msk) {/* If host channel interrupt*/
    ptr_CH = (USBH_XMC4500_CH *)(USB0_CH0);
    for (ch = 0; ch < USB0_MAX_CH; ch++) {
      if (haint & (1 << ch)) {                    /* If channels interrupt act*/
        hcint   = ptr_CH->HCINT & ptr_CH->HCINTMSK;
        ptr_URB = CHURB[ch];                      /* Pointer to channels URB  */
        ptr_URB->Error |= ((hcint & 0x3F80) >> 6) | ((hcint & 0x0004) >> 2);
        if ((ptr_URB->PacketType == USBH_PACKET_OUT) ||     /* If OUT packet  ----------*/
            (ptr_URB->PacketType == USBH_PACKET_SETUP)) {   /* or SETUP packet----------*/
          if (hcint & USB_CH_HCINT_XferCompl_Msk){/* If data transfer finished*/
            ptr_CH->HCINTMSK         = 0;
            ptr_URB->DataTransferred = ptr_URB->DataLength;
            ptr_URB->Status          = 0;
            ptr_URB->ResponsePacketType = USBH_PACKET_ACK;
            ptr_URB->Completed       = 1;
            CHURB[ch]                = 0;
          } else if (hcint & USB_CH_HCINT_STALL_Msk) {      /* If STALL event */
            ptr_URB->ResponsePacketType = USBH_PACKET_STALL;
            ptr_CH->HCINTMSK         = USB_CH_HCINTMSK_ChHltdMsk_Msk;
                                                  /* Halt the channel         */
            ptr_CH->HCCHAR          |= USB_CH_HCCHAR_ChDis_Msk;
          } else if ((hcint & USB_CH_HCINT_NAK_Msk)   ||    /* If NAK received*/
                     (hcint & USB_CH_HCINT_XactErr_Msk)) {  /* If TXERR rece  */
            if (hcint & USB_CH_HCINT_NAK_Msk) {
              ptr_URB->ResponsePacketType = USBH_PACKET_NAK;
              ptr_CH->HCINTMSK       = USB_CH_HCINTMSK_ChHltdMsk_Msk;
            } else {
              ptr_URB->Error         = 0x02;
              ptr_CH->HCINTMSK       = USB_CH_HCINTMSK_AckMsk_Msk | USB_CH_HCINTMSK_ChHltdMsk_Msk;
            }
            if (ptr_URB->DataLength) {
                                                  /* Update transfer info     */
              pktcnt                 = (ptr_CH->HCTSIZ >> 19) & 0x3FF;
              mps                    = (ptr_CH->HCCHAR >>  0) & 0x7FF;

              ptr_URB->DataTransferred = (((ptr_URB->DataLength + mps - 1) / mps) - pktcnt) * mps;
            }
                                                  /* Halt the channel         */
            ptr_CH->HCCHAR          |= USB_CH_HCCHAR_ChEna_Msk | USB_CH_HCCHAR_ChDis_Msk;
          } else if (hcint&USB_CH_HCINT_ChHltd_Msk) { /* If channel halted    */
            if ((ptr_CH->EPTYP != USB_ENDPOINT_TYPE_INTERRUPT)   && 
                (ptr_URB->ResponsePacketType == USBH_PACKET_NAK) && 
                (CHURB[ch]->NAKRetries--)) {
                                                  /* Reenable channel         */
              USBH_XMC4500_CH_TransferEnqueue (ptr_CH, (U8)CHURB[ch]->Parameters, (U8 *)CHURB[ch]->ptrDataBuffer+CHURB[ch]->DataTransferred, (U32)CHURB[ch]->DataLength-CHURB[ch]->DataTransferred);
              CHURB[ch]->TimeoutCount= MAX_TIMEOUT_COUNT;
            } else {
              ptr_CH->HCINTMSK       = 0;
              ptr_URB->Submitted     = 0;
              ptr_URB->InProgress    = 0;
              ptr_URB->Completed     = 1;
              CHURB[ch]              = 0;
            }
          } else if (hcint&USB_CH_HCINT_ACK_Msk) {/* If ACK received          */
            ptr_URB->ResponsePacketType = USBH_PACKET_ACK;
            ptr_URB->Error           = 0;
            ptr_CH->HCINTMSK        &=~USB_CH_HCINTMSK_AckMsk_Msk;
          }
        } else if (ptr_URB->PacketType == USBH_PACKET_IN) { /* If IN packet   ----------*/
          if (hcint & USB_CH_HCINT_XferCompl_Msk) {
            ptr_URB->ResponsePacketType = USBH_PACKET_ACK;
            ptr_URB->Error           = 0;
            ptr_CH->HCINTMSK         = USB_CH_HCINTMSK_ChHltdMsk_Msk;
                                                  /* Halt the channel         */
            ptr_CH->HCCHAR          |= USB_CH_HCCHAR_ChEna_Msk | USB_CH_HCCHAR_ChDis_Msk;
          } else if (hcint&USB_CH_HCINT_NAK_Msk) {/* If NAK received          */
            ptr_URB->ResponsePacketType = USBH_PACKET_NAK;
            if ((Port_Con) && (ptr_CH->EPTYP != USB_ENDPOINT_TYPE_INTERRUPT) && (CHURB[ch]->NAKRetries--)) {
                                                  /* Reenable channel         */
              ptr_CH->HCINTMSK       = USB_CH_HCINTMSK_DataTglErrMsk_Msk | 
                                       USB_CH_HCINTMSK_BblErrMsk_Msk     | 
                                       USB_CH_HCINTMSK_XactErrMsk_Msk    | 
                                       USB_CH_HCINTMSK_AckMsk_Msk        | 
                                       USB_CH_HCINTMSK_NakMsk_Msk        | 
                                       USB_CH_HCINTMSK_StallMsk_Msk      | 
                                       USB_CH_HCINTMSK_XferComplMsk_Msk  ;
              ptr_CH->HCCHAR        |= USB_CH_HCCHAR_ChEna_Msk;
              CHURB[ch]->TimeoutCount= MAX_TIMEOUT_COUNT;
            } else {
                                                  /* Halt the channel         */
              ptr_CH->HCINTMSK       = USB_CH_HCINTMSK_ChHltdMsk_Msk;
              ptr_CH->HCCHAR        |= USB_CH_HCCHAR_ChEna_Msk | USB_CH_HCCHAR_ChDis_Msk;
            }
          } else if ((hcint & USB_CH_HCINT_XactErr_Msk) ||  /* If TXERR event */
                     (hcint & USB_CH_HCINT_BblErr_Msk)  ||  /* If BBERR event */
                     (hcint & USB_CH_HCINT_STALL_Msk))   {  /* If STALL event */
            ptr_CH->HCINTMSK         = USB_CH_HCINTMSK_ChHltdMsk_Msk;
            if (hcint & USB_CH_HCINT_XactErr_Msk) {
              ptr_URB->Error         = 0x02;
              ptr_CH->HCINTMSK      |= USB_CH_HCINTMSK_AckMsk_Msk;
            } else if (hcint & USB_CH_HCINT_BblErr_Msk) {
              ptr_URB->Error         = 0x04;
            } else {
              ptr_URB->ResponsePacketType = USBH_PACKET_STALL;
            }
                                                  /* Halt the channel         */
            ptr_CH->HCCHAR          |= USB_CH_HCCHAR_ChEna_Msk | USB_CH_HCCHAR_ChDis_Msk;
          } else if (hcint&USB_CH_HCINT_ChHltd_Msk) { /* If Channel Halted    */
            ptr_CH->HCINTMSK         = 0;
            ptr_URB->Submitted       = 0;
            ptr_URB->InProgress      = 0;
            ptr_URB->Completed       = 1;
            CHURB[ch]                = 0;
            if (ptr_URB->Completed && ptr_URB->CompletedCallback) {
              ptr_URB->CompletedCallback();
            }
          } else if (hcint&USB_CH_HCINT_ACK_Msk) {/* If ACK received          */
            ptr_URB->ResponsePacketType = USBH_PACKET_ACK;
            ptr_URB->Error           = 0;
            if (ptr_CH->EPTYP != USB_ENDPOINT_TYPE_INTERRUPT) {
              ptr_CH->HCINTMSK       = USB_CH_HCINTMSK_DataTglErrMsk_Msk | 
                                       USB_CH_HCINTMSK_BblErrMsk_Msk     | 
                                       USB_CH_HCINTMSK_XactErrMsk_Msk    | 
                                       USB_CH_HCINTMSK_AckMsk_Msk        | 
                                       USB_CH_HCINTMSK_NakMsk_Msk        | 
                                       USB_CH_HCINTMSK_StallMsk_Msk      | 
                                       USB_CH_HCINTMSK_XferComplMsk_Msk  ;
                                                  /* Reenable channel         */
              ptr_CH->HCCHAR        |= USB_CH_HCCHAR_ChEna_Msk;
              CHURB[ch]->TimeoutCount= MAX_TIMEOUT_COUNT;
            } else {
              ptr_CH->HCINTMSK       = USB_CH_HCINTMSK_ChHltdMsk_Msk;
                                                  /* Halt the channel         */
              ptr_CH->HCCHAR        |= USB_CH_HCCHAR_ChEna_Msk | USB_CH_HCCHAR_ChDis_Msk;
            }
          } else if (hcint&USB_CH_HCINT_DataTglErr_Msk) { /* If DTERR received*/
          }
        }
        ptr_CH->HCINT = 0x3FFF;
      }
      ptr_CH++;
    }
  }  
  USB0->GINTSTS_HOSTMODE = gintsts;               /* Clear core interrupts    */
  if (gintsts & USB_GINTSTS_HOSTMODE_Sof_Msk) {   /* If start of frame int    */
    if (HW_Accessing) {
      act = 1;
    } else {
      act = 0;
      for (ch = 0; ch < USB0_MAX_CH; ch++) {
        if (CHURB[ch]) {
          if (CHURB[ch]->InProgress == 1) {       /* If any URB in progress   */
            act = 1;                              /* Set act to 1             */
            break;
          }
        }
      }
    }

    /* At this point act == 1 if there is USB bus activity                    */
    ptr_CH = (USBH_XMC4500_CH *)(USB0_CH0);
    for (ch = 0; ch < USB0_MAX_CH; ch++) {
      ptr_URB = CHURB[ch];                        /* Pointer to channels URB  */
      if (ptr_URB) {
        if ((ptr_URB->Submitted  == 1) &&         /* If URB is submitted      */
            (ptr_URB->InProgress == 0)) {         /* If URB not in progress   */
          if (ptr_CH->EPTYP == USB_ENDPOINT_TYPE_INTERRUPT) {
            if (cntInterval[ch]) {
              if ((act && (cntInterval[ch] > 1)) || !act)
                cntInterval[ch]--;
              }
              if (!act) {
                if (!cntInterval[ch]) {           /* If period expired        */
                  ptr_URB->InProgress = 1;
                  USBH_XMC4500_CH_TransferEnqueue (ptr_CH, (U8)ptr_URB->Parameters, (U8 *)ptr_URB->ptrDataBuffer, (U32)ptr_URB->DataLength);
                  act = 1;
                }
              }
          } else if (!act) {
            ptr_URB->InProgress = 1;
            USBH_XMC4500_CH_TransferEnqueue (ptr_CH, (U8)ptr_URB->Parameters, (U8 *)ptr_URB->ptrDataBuffer, (U32)ptr_URB->DataLength);
            act = 1;
          }
        }
      }
      ptr_CH++;
    }
  }
}
